In [1]:
import pandas as pd

A progressão e muito interessante em questão de logica

In [2]:
dados = {
    'Nome' : ['João', 'Luis', 'Henrique'],
    'Idade' : [24, 30, 22],
    'Cidade' : ['Salvado', 'Recife', 'Vila Velha']
}

In [ ]:
#Convertendo dicionario em dataframe

df = pd.DataFrame(dados)
df.head() #Acessando as 5 primeiras posições com o head

       Nome  Idade      Cidade
0      João     24     Salvado
1      Luis     30      Recife
2  Henrique     22  Vila Velha

In [7]:
df.tail() #Acessando as 5 ultimas linhas com o tail

       Nome  Idade      Cidade
0      João     24     Salvado
1      Luis     30      Recife
2  Henrique     22  Vila Velha

In [8]:
df.head(1) #Especificando o head para pegar somente ate s primeira linha

   Nome  Idade   Cidade
0  João     24  Salvado

In [9]:
dadosNotas = {
    'Nome' : ['Tango', 'Maria', 'Julia'],
    'Matematica' : [6.7, 8.0, 9.0],
    'Geografia' : [9.2, 8.3, 4.2]
}

In [10]:
dfNotas = pd.DataFrame(dadosNotas)
dfNotas.head()

    Nome  Matematica  Geografia
0  Tango         6.7        9.2
1  Maria         8.0        8.3
2  Julia         9.0        4.2

In [12]:
#Criando uma nova coluna no df com a media das notas por aluno

dfNotas['Media'] = dfNotas[['Matematica', 'Geografia']].mean(axis=1)#Quando eu não especifico uma coluna existente no df ele me gera uma nova
dfNotas.head()

    Nome  Matematica  Geografia  Media
0  Tango         6.7        9.2   7.95
1  Maria         8.0        8.3   8.15
2  Julia         9.0        4.2   6.60

In [ ]:
#Identificando alunos aprovados com nota maior que 8

alunoAprovados  = dfNotas[dfNotas['Media']>8] #E necessario especificar a macara com o proprio df e coluna dentro do df pois assim ele retornara um df resultante e não um recorte do df que não e um df
alunoAprovados.head()

    Nome  Matematica  Geografia  Media
1  Maria         8.0        8.3   8.15

In [22]:
#Exibir a media e os alunos aprovados

dfAprovados = dfNotas[['Nome', 'Media']]
dfAprovados.head()

    Nome  Media
0  Tango   7.95
1  Maria   8.15
2  Julia   6.60